_posts/2013-07-06-Uncertainty-in-polynomial-roots---Part-II.html
---
title: Uncertainty in polynomial roots - Part II
date: 2013/07/06 15:31:38
updated: 2013/07/06 15:31:38
categories: data analysis, uncertainty
tags: 
---


<p>
We previously looked at uncertainty in polynomial roots where we had an analytical formula for the roots of the polynomial, and we knew the uncertainties in the polynomial parameters. It would be inconvenient to try this for a cubic polynomial, although there may be formulas for the roots. I do not know of there are general formulas for the roots of a 4<sup>th</sup> order polynomial or higher. 
</p>

<p>
Unfortunately, we cannot use the uncertainties package out of the box directly here.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> uncertainties <span style="color: #8b0000;">as</span> u
<span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np
c, b, a = [-0.99526746, -0.011546,    1.00188999]
sc, sb, sa = [ 0.0249142,   0.00860025,  0.00510128]

A = u.ufloat((a, sa))
B = u.ufloat((b, sb))
C = u.ufloat((c, sc))

<span style="color: #8b0000;">print</span> np.roots([A, B, C])
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; Traceback (most recent call last):
  File "&lt;stdin&gt;", line 1, in &lt;module&gt;
  File "c:\Users\jkitchin\AppData\Local\Enthought\Canopy\User\lib\site-packages\numpy\lib\polynomial.py", line 218, in roots
    p = p.astype(float)
  File "c:\Users\jkitchin\AppData\Local\Enthought\Canopy\User\lib\site-packages\uncertainties\__init__.py", line 1257, in raise_error
    % (self.__class__, coercion_type))
TypeError: can't convert an affine function (&lt;class 'uncertainties.Variable'&gt;) to float; use x.nominal_value
</pre>

<p>
To make some progress, we have to understand how the <a href="https://github.com/numpy/numpy/blob/v1.7.0/numpy/lib/polynomial.py#L149">numpy.roots</a> function works. It constructs a <a href="http://en.wikipedia.org/wiki/Companion_matrix">Companion matrix</a>, and the eigenvalues of that matrix are the same as the roots of the polynomial.  
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np

c0, c1, c2 = [-0.99526746, -0.011546,    1.00188999]

p = np.array([c2, c1, c0])
N = <span style="color: #8b0000;">len</span>(p)

<span style="color: #ff0000; font-weight: bold;"># we construct the companion matrix like this</span>
<span style="color: #ff0000; font-weight: bold;"># see https://github.com/numpy/numpy/blob/v1.7.0/numpy/lib/polynomial.py#L220</span>
<span style="color: #ff0000; font-weight: bold;"># for this code.</span>
<span style="color: #ff0000; font-weight: bold;"># build companion matrix and find its eigenvalues (the roots)</span>
A = np.diag(np.ones((N-2,), p.dtype), -1)
A[0, :] = -p[1:] / p[0]

<span style="color: #8b0000;">print</span> A

roots = np.linalg.eigvals(A)
<span style="color: #8b0000;">print</span> roots
</pre>
</div>

<pre class="example">
[[ 0.01152422  0.99338996]
 [ 1.          0.        ]]
[ 1.00246827 -0.99094405]
</pre>

<p>
This definition of the companion matrix is a little different than the one <a href="http://en.wikipedia.org/wiki/Companion_matrix">here</a>, but primarily in the scaling of the coefficients. That does not seem to change the eigenvalues, or the roots. 
</p>

<p>
Now, we have a path to estimate the uncertainty in the roots. Since we know the polynomial coefficients and their uncertainties from the fit, we can use Monte Carlo sampling to estimate the uncertainty in the roots. 
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np
<span style="color: #8b0000;">import</span> uncertainties <span style="color: #8b0000;">as</span> u

c, b, a = [-0.99526746, -0.011546,    1.00188999]
sc, sb, sa = [ 0.0249142,   0.00860025,  0.00510128]

NSAMPLES = 100000
A = np.random.normal(a, sa, (NSAMPLES, ))
B = np.random.normal(b, sb, (NSAMPLES, ))
C = np.random.normal(c, sc, (NSAMPLES, ))

roots = [[] <span style="color: #8b0000;">for</span> i <span style="color: #8b0000;">in</span> <span style="color: #8b0000;">range</span>(NSAMPLES)]

<span style="color: #8b0000;">for</span> i <span style="color: #8b0000;">in</span> <span style="color: #8b0000;">range</span>(NSAMPLES):
    p = np.array([A[i], B[i], C[i]])
    N = <span style="color: #8b0000;">len</span>(p)
    
    M = np.diag(np.ones((N-2,), p.dtype), -1)
    M[0, :] = -p[1:] / p[0]
    r = np.linalg.eigvals(M)
    r.sort()  <span style="color: #ff0000; font-weight: bold;"># there is no telling what order the values come out in</span>
    roots[i] = r
    
avg = np.average(roots, axis=0)
std = np.std(roots, axis=0)

<span style="color: #8b0000;">for</span> r, s <span style="color: #8b0000;">in</span> <span style="color: #8b0000;">zip</span>(avg, std):
    <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'{0: f} +/- {1: f}'</span>.format(r, s)
</pre>
</div>

<pre class="example">
-0.990949 +/-  0.013435
 1.002443 +/-  0.013462
</pre>

<p>
Compared to our previous approach with the uncertainties package where we got:
</p>

<pre class="example">
: -0.990944048037+/-0.0134208013339
:  1.00246826738 +/-0.0134477390832
</pre>

<p>
the agreement is quite good! The advantage of this approach is that we do not have to know the formula for the roots of higher order polynomials to estimate the uncertainty in the roots. The downside is we have to evaluate the eigenvalues of a matrix a large number of times to get good estimates of the uncertainty. For high power polynomials this could be problematic. I do not currently see a way around this, unless it becomes possible to get the uncertainties package to propagate through the numpy.eigvals function. It is possible to <a href="http://pythonhosted.org/uncertainties/user_guide.html#making-custom-functions-accept-numbers-with-uncertainties">wrap</a> some functions with uncertainties, but so far only functions that return a single number.
</p>

<p>
There are some other potential problems with this approach.  It is assumed that the accuracy of the eigenvalue solver is much better than the uncertainty in the polynomial parameters. You have to use some judgment in using these uncertainties. We are approximating the uncertainties of a nonlinear problem. In other words, the uncertainties of the roots are not linearly dependent on the uncertainties of the polynomial coefficients.  
</p>

<p>
It is possible to <a href="http://pythonhosted.org/uncertainties/user_guide.html#making-custom-functions-accept-numbers-with-uncertainties">wrap</a> some functions with uncertainties, but so far only functions that return a single number. Here is an example of getting the n<sup>th</sup> root and its uncertainty.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> uncertainties <span style="color: #8b0000;">as</span> u
<span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np

@u.wrap
<span style="color: #8b0000;">def</span> <span style="color: #8b2323;">f</span>(n=0, *P):
    <span style="color: #228b22;">''' compute the nth root of the polynomial P and the uncertainty of the root'''</span>
    p =  np.array(P)
    N = <span style="color: #8b0000;">len</span>(p)
    
    M = np.diag(np.ones((N-2,), p.dtype), -1)
    M[0, :] = -p[1:] / p[0]
    r = np.linalg.eigvals(M)
    r.sort()  <span style="color: #ff0000; font-weight: bold;"># there is no telling what order the values come out in</span>
    <span style="color: #8b0000;">return</span> r[n]

<span style="color: #ff0000; font-weight: bold;"># our polynomial coefficients and standard errors</span>
c, b, a = [-0.99526746, -0.011546,    1.00188999]
sc, sb, sa = [ 0.0249142,   0.00860025,  0.00510128]

A = u.ufloat((a, sa))
B = u.ufloat((b, sb))
C = u.ufloat((c, sc))

<span style="color: #8b0000;">for</span> result <span style="color: #8b0000;">in</span> [f(n, A, B, C) <span style="color: #8b0000;">for</span> n <span style="color: #8b0000;">in</span> [0, 1]]:
    <span style="color: #8b0000;">print</span> result
</pre>
</div>

<pre class="example">
-0.990944048037+/-0.013420800377
1.00246826738+/-0.0134477388218
</pre>

<p>
It is good to see this is the same result we got earlier, with <i>a lot less work</i> (although we do have to solve it for each root, which is a bit redundant)! It is a bit more abstract though, and requires a specific formulation of the function for the wrapper to work.
</p>
<p>Copyright (C) 2013 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2013/07/06/Uncertainty-in-polynomial-roots---Part-II.org">org-mode source</a><p>